meowkittiesBE/app/controllers/contributors_controller.rb

SELECT  "contributions".* FROM "contributions" LIMIT 20
---
  def index
    @contribution = Contribution.all.limit(20)